{
    "yin": {
        "title": "Pitch Estimation (Yin)",
        "description": "The parameters in this box control various aspects of the pitch estimation. The analysis is based on the OMax.yin+ object and the full documentation of these parameters is available by clicking the button below. Note that the «Window» controls the latency of the pitch estimation.\n\nFor more information of the pitch analysis in context, see the «monophonic» tab.\n\nThe button in the right hand corner will blink each time a pitch is detected."
    },
    "bonk": {
        "title": "Onset Detection (Bonk)",
        "description": "These parameters control various aspects of the onset detection. When Yin is used for both onset detection and pitch segmentation (the default setting), this box will be unavailable. The analysis is based on the bonk~ object, and the full documentation of these parameters is available by clicking the button below. For more information of the onset detection in context, see the «polyphonic/unpitched» tab. The button in the right hand corner will blink each time a pitch is detected."
    },
    "onsetmethod": {
        "title": "Onset Detection from",
        "description": "This determines which algorithm should be used for onset detection."
    },
    "pitchsegmethod": {
        "title": "Pitch Segmentation from",
        "description": "This determines when the pitch estimation should generate an influence. By default, each estimated pitch immediately generates an influence («Pitch Detection (Yin)»). It's however possible to set this so that pitch influences are only sent upon (Bonk's) onset detection or even synchronize it to an external bang on the middle inlet. This can be useful if, for example, the need of low latency requires the (Yin) parameter «Window» to be set very low, thus generating a lot of false onsets. In this case, the pitch information of these detections will still generate influences, but at a rate corresponding to the detected onsets if this parameter is set to «Onset Detection (Bonk)»."
    }
}